ahk_scripts/anything-doc.org
* Introduction
  
If you use GNU/Emacs  maybe you have known "Anything"
maybe not , 
you can visit "Anything" on [[http://www.emacswiki.org/emacs/Anything%20][Emacswiki]]
and see what "Anything" it is .
and this isn't anything.el ,it 's anything.ahk.
if you think anything.ahk is great ,
and have written an anything-source for it ,you can post it here .
  
there is a screencast here :
+ http://www.screenr.com/xxss
+ http://www.screenr.com/vp8s (new one )
+ http://www.screenr.com/BH7s and another one show anything-favorite-directories.ahk
+ http://www.screenr.com/MyHs and another show anything-window-switch.ahk

you can also download these videos
+ http://screencast-repos.googlecode.com/files/anything-expl-run.mp4
+ http://screencast-repos.googlecode.com/files/anything.ahk-anything-explorer-history.mp4
+ http://screencast-repos.googlecode.com/files/anything-window-switch.mp4
+ http://screencast-repos.googlecode.com/files/anything-fav-dir.mp4

and source code is host on
+ https://github.com/jixiuf/my_autohotkey_scripts/tree/master/ahk_scripts

you can follow these links ,and save them on you disk .
+ https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything.ahk
+ https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-explorer-history.ahk
+ https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-favorite-directories.ahk
+ https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-run.ahk
+ https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-window-switch.ahk
+ https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-config.ahk

* Active <Anything>
  to active anything.ahk , press F3 , or Windows+r , or Alt+TAB
  see  [[https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-config.ahk][anything-config.ahk]]  for detail 
* keybindings when <Anything> is activated 
  you can input search string just like google to narrow the candidates
** keybindings for select candiates
| Down or Ctrl+n          | select next candidate                                                                     |
| Up or Ctrl+p            | select previous candidate                                                                 |
| Ctrl+o                  | will select next source ,that means ,all candidate from first source will be send to last |
| pageUp ,Ctrl-r ,Alt-v   | pageup                                                                                    |
| pageDn ,Ctrl-v          | pageDn                                                                                    |

** keybindings for execute actions

| <Click>and  <Enter>  | to execute the default action with the selected candiate as parameter                                                                             |
| <Ctrl-j>             | to execute the second action with the selected candidate as parameter                                                                             |
| <Ctrl-m>             | to execute the third action with the selected candidate as parameter                                                                              |
| <Ctrl-z> <Alt-Enter> | do the same to Enter ,but doesn't quit "Anything"                                                                                                 |
| <Alt-j>              | do the same to Ctrl-j ,but doesn't quit "Anything"                                                                                                |
| <Alt-m>              | do the same to Ctrl-m ,but doesn't quit "Anything"                                                                                                |
| <tab>                | will list all available actions , and you can select one to execute .                                                                             |
| <Ctrl-L>             | will ignore all the candidates ,and treate the search string as candidate , and list all available "action" to execute on the special "candidate" |
| <Ctrl-i>             | do something similar to <Ctrl-l> ,but don't list all available "action" ,just execute the "action" special by "property": no_candidate_action     |
| <Esc> and <Ctrl-g>   | quit Anything                                                                                                                                     |

** keybindings for edit
| Ctrl-u               | delete all search string |
| backspace and Ctrl-h | back delete a char       |
| Ctrl-y               | paste                    |

* anything-source I have written
Now I have wrote 4 <anything-source> for anything.ahk
  +  anything-explorer-history.ahk ,
  +  anything-favorite-directories.ahk,
  +  anything-run.ahk (a replacement of Windows+r)
  +  anything-window-switch.ahk (a replacement of Alt-Tab)

**  anything-explorer-history.ahk
   when you visit  directory (double click on a directory,up or back ) in
   explorer.exe ,it can remember directories 
   you have visited ,then you can press  <F3> to active "Anything"
   list all directory history ,you can revisit it easyly.
   how to use anything-explorer-history.ahk
    
