ahk_scripts/anything-doc.html

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="zh" xml:lang="zh">
<head>
<title>anything-doc</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-12-19 11:59:14 中国标准时间"/>
<meta name="author" content="纪秀峰"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">anything-doc</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction </a></li>
<li><a href="#sec-2">Active &lt;Anything&gt; </a></li>
<li><a href="#sec-3">keybindings when &lt;Anything&gt; is activated </a>
<ul>
<li><a href="#sec-3-1">keybindings for select candiates </a></li>
<li><a href="#sec-3-2">keybindings for execute actions </a></li>
<li><a href="#sec-3-3">keybindings for edit </a></li>
</ul>
</li>
<li><a href="#sec-4">anything-source I have written </a>
<ul>
<li><a href="#sec-4-1">anything-explorer-history.ahk </a></li>
<li><a href="#sec-4-2">anything-favorite-directories.ahk  do something like anything-explorer-history.ahk </a></li>
<li><a href="#sec-4-3">anything-run.ahk is a replacement of &lt;Win-r&gt; </a></li>
<li><a href="#sec-4-4">anything-window-switch.ahk is a replacement of Alt-Tab </a></li>
<li><a href="#sec-4-5">you just need download: </a></li>
</ul>
</li>
<li><a href="#sec-5">how to  write an anything-source </a>
<ul>
<li><a href="#sec-5-1">1 &lt;name&gt;  (needed) </a></li>
<li><a href="#sec-5-2">2 &lt;candidate&gt;  (needed) </a></li>
<li><a href="#sec-5-3">3 &lt;action&gt;  (needed) </a></li>
<li><a href="#sec-5-4">4 &lt;icon&gt; (optional) </a></li>
<li><a href="#sec-5-5">5 &lt;anything-execute-action-at-once-if-one&gt; (optional) </a></li>
<li><a href="#sec-5-6">6 call anything </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Introduction </h2>
<div class="outline-text-2" id="text-1">


<p>  
If you use GNU/Emacs  maybe you have known "Anything"
maybe not , 
you can visit "Anything" on <a href="http://www.emacswiki.org/emacs/Anything ">Emacswiki</a>
and see what "Anything" it is .
and this isn't anything.el ,it 's anything.ahk.
if you think anything.ahk is great ,
and have written an anything-source for it ,you can post it here .
</p>
<p>  
there is a screencast here :
</p><ul>
<li><a href="http://www.screenr.com/xxss">http://www.screenr.com/xxss</a>
</li>
<li><a href="http://www.screenr.com/vp8s">http://www.screenr.com/vp8s</a> (new one )
</li>
<li><a href="http://www.screenr.com/BH7s">http://www.screenr.com/BH7s</a> and another one show anything-favorite-directories.ahk
</li>
<li><a href="http://www.screenr.com/MyHs">http://www.screenr.com/MyHs</a> and another show anything-window-switch.ahk
</li>
</ul>


<p>
you can also download these videos
</p><ul>
<li><a href="http://screencast-repos.googlecode.com/files/anything-expl-run.mp4">http://screencast-repos.googlecode.com/files/anything-expl-run.mp4</a>
</li>
<li><a href="http://screencast-repos.googlecode.com/files/anything.ahk-anything-explorer-history.mp4">http://screencast-repos.googlecode.com/files/anything.ahk-anything-explorer-history.mp4</a>
</li>
<li><a href="http://screencast-repos.googlecode.com/files/anything-window-switch.mp4">http://screencast-repos.googlecode.com/files/anything-window-switch.mp4</a>
</li>
<li><a href="http://screencast-repos.googlecode.com/files/anything-fav-dir.mp4">http://screencast-repos.googlecode.com/files/anything-fav-dir.mp4</a>
</li>
</ul>


<p>
and source code is host on
</p><ul>
<li><a href="https://github.com/jixiuf/my_autohotkey_scripts/tree/master/ahk_scripts">https://github.com/jixiuf/my_autohotkey_scripts/tree/master/ahk_scripts</a>
</li>
</ul>


<p>
you can follow these links ,and save them on you disk .
</p><ul>
<li><a href="https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything.ahk">https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything.ahk</a>
</li>
<li><a href="https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-explorer-history.ahk">https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-explorer-history.ahk</a>
</li>
<li><a href="https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-favorite-directories.ahk">https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-favorite-directories.ahk</a>
</li>
<li><a href="https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-run.ahk">https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-run.ahk</a>
</li>
<li><a href="https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-window-switch.ahk">https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-window-switch.ahk</a>
</li>
<li><a href="https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-config.ahk">https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-config.ahk</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Active &lt;Anything&gt; </h2>
<div class="outline-text-2" id="text-2">

<p>  to active anything.ahk , press F3 , or Windows+r , or Alt+TAB
  see  <a href="https://github.com/jixiuf/my_autohotkey_scripts/raw/master/ahk_scripts/anything-config.ahk">anything-config.ahk</a>  for detail 
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">keybindings when &lt;Anything&gt; is activated </h2>
<div class="outline-text-2" id="text-3">

<p>  you can input search string just like google to narrow the candidates
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">keybindings for select candiates </h3>
<div class="outline-text-3" id="text-3-1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Down or Ctrl+n</td><td class="left">select next candidate</td></tr>
<tr><td class="left">Up or Ctrl+p</td><td class="left">select previous candidate</td></tr>
<tr><td class="left">Ctrl+o</td><td class="left">will select next source ,that means ,all candidate from first source will be send to last</td></tr>
<tr><td class="left">pageUp ,Ctrl-r ,Alt-v</td><td class="left">pageup</td></tr>
<tr><td class="left">pageDn ,Ctrl-v</td><td class="left">pageDn</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">keybindings for execute actions </h3>
<div class="outline-text-3" id="text-3-2">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">&lt;Click&gt;and  &lt;Enter&gt;</td><td class="left">to execute the default action with the selected candiate as parameter</td></tr>
<tr><td class="left">&lt;Ctrl-j&gt;</td><td class="left">to execute the second action with the selected candidate as parameter</td></tr>
<tr><td class="left">&lt;Ctrl-m&gt;</td><td class="left">to execute the third action with the selected candidate as parameter</td></tr>
<tr><td class="left">&lt;Ctrl-z&gt; &lt;Alt-Enter&gt;</td><td class="left">do the same to Enter ,but doesn't quit "Anything"</td></tr>
<tr><td class="left">&lt;Alt-j&gt;</td><td class="left">do the same to Ctrl-j ,but doesn't quit "Anything"</td></tr>
<tr><td class="left">&lt;Alt-m&gt;</td><td class="left">do the same to Ctrl-m ,but doesn't quit "Anything"</td></tr>
<tr><td class="left">&lt;tab&gt;</td><td class="left">will list all available actions , and you can select one to execute .</td></tr>
<tr><td class="left">&lt;Ctrl-L&gt;</td><td class="left">will ignore all the candidates ,and treate the search string as candidate , and list all available "action" to execute on the special "candidate"</td></tr>
<tr><td class="left">&lt;Ctrl-i&gt;</td><td class="left">do something similar to &lt;Ctrl-l&gt; ,but don't list all available "action" ,just execute the "action" special by "property": no<sub>candidate</sub><sub>action</sub></td></tr>
<tr><td class="left">&lt;Esc&gt; and &lt;Ctrl-g&gt;</td><td class="left">quit Anything</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">keybindings for edit </h3>
<div class="outline-text-3" id="text-3-3">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Ctrl-u</td><td class="left">delete all search string</td></tr>
<tr><td class="left">backspace and Ctrl-h</td><td class="left">back delete a char</td></tr>
<tr><td class="left">Ctrl-y</td><td class="left">paste</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">anything-source I have written </h2>
<div class="outline-text-2" id="text-4">

<p>Now I have wrote 4 &lt;anything-source&gt; for anything.ahk
</p><ul>
<li>anything-explorer-history.ahk ,
</li>
<li>anything-favorite-directories.ahk,
</li>
<li>anything-run.ahk (a replacement of Windows+r)
</li>
<li>anything-window-switch.ahk (a replacement of Alt-Tab)
</li>
</ul>



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">anything-explorer-history.ahk </h3>
<div class="outline-text-3" id="text-4-1">

<p>   when you visit  directory (double click on a directory,up or back ) in
   explorer.exe ,it can remember directories 
   you have visited ,then you can press  &lt;F3&gt; to active "Anything"
   list all directory history ,you can revisit it easyly.
   how to use anything-explorer-history.ahk
</p>
<ul>
