ahk_scripts/anything-doc.org
***    if you only have one anything-source :
       anything_explorer_history_source  (defined in  anything-explorer-history.ahk)
       you can use it like this :
   #+begin_src c
       #include anything.ahk
       #include anything-explorer-history.ahk
       f3::anything(anything_explorer_history_source)
   #+end_src
       
***      if you also have other anything-sources ,
        default  : it is included in anything-config.ahk
        you just need add 
            anything_explorer_history_source
        to the sources
       for example :
#+begin_src c
       f3::
       sources:=Array()
       sources.insert(anything_explorer_history_source)
       sources.insert(anything_favorite_directories_source)
       sources.insert(anything_cmd_source)
       anything_multiple_sources(sources)
       return
#+end_src       
*** actions for anything-explorer-history.ahk
    #+begin_src c
   anything_explorer_history_source["action"]:=Array("visit_directory","delete_from_directory_history" ,"delete_all_directory_history")
    #+end_src
| actions                       | description                                     | key binding         |
|-------------------------------+-------------------------------------------------+---------------------|
| visit_directory               | visit selected directory                        | <Click>and  <Enter> |
| delete_from_directory_history | delete select directory from  directory history | <Ctrl-j>            |
| delete_all_directory_history  | add a new directory to  directory history       | <Ctrl-m>            |
| list all actions              |                                                 | <Ctrl-L>            |
   
**  anything-favorite-directories.ahk  do something like anything-explorer-history.ahk
   add your favorite directories ,and visit it using "Anything".
   about how to use it .see comments in anything-favorite-directories.ahk
   if you use anything-favorites-directory as the only source for anything.ahk
   you just need to bind it to a key like this :
    #+begin_src c
      #include anything.ahk
      #include anything-favorites-directory.ahk
      f1::anything(anything_favorite_directories_source)
    #+end_src

   if you also use other sources ,just need add "anything_favorite_directories_source" to 
   the array of sources for anything_multiple_sources(sources)
   default have added to  anything-config.ahk 

***    how to add a new Folder to your favorite-directories
   first activate "Anything" and Press <Ctrl-L> list all available actions
   select "call action: Favdirs.anything_favorite_directories_add "
   about what the meaning of <Ctrl-L>
   anything_favorite_directories_source have three actions
   anything_favorite_directories_source["action"]:=Array("anything_favorite_directories_visit","anything_favorite_directories_delete","anything_favorite_directories_add")
*** actions for   anything-favorite-directories.ahk 
| actions                              | description                                       | key binding         |
|--------------------------------------+---------------------------------------------------+---------------------|
| anything_favorite_directories_visit  | visit selected directory                          | <Click>and  <Enter> |
| anything_favorite_directories_delete | delete select directory from favorite directories | <Ctrl-j>            |
| anything_favorite_directories_add    | add a new directory to favorite directories       | <Ctrl-m>            |
| list all actions                     |                                                   | <Ctrl-L>            |

***    then you can use "Anything" selected one of your favorite directory 
   + it will visit it in current Explorer.exe (if current activated window is Explorer.exe)
   + it will visit it in current cmd.exe (if current activated window is cmd.exe)
   + it will visit it in current msys.bat (if current activated window is msys.bat)


** anything-run.ahk is a replacement of <Win-r>
   it could remember old  command too. when you press <F3>
   about how to use it .see comments in anything-run.ahk
** anything-window-switch.ahk is a replacement of Alt-Tab   
   
** you just need download:
   + anything.ahk
   + anything-explorer-history.ahk
   + anything-favorite-directories.ahk
   + anything-run.ahk
   + anything-window-switch.ahk
   + anything-config.ahk
   + and run anything-config.ahk
 
* how to  write an anything-source
  an anything-source is an Object with some defined properties
  now it support 5 anything-source-properties :
  + name
  + action
  + candidate
  + icon
  + anything-execute-action-at-once-if-one
  for example:
  #+begin_src c
        my_source:=Object()
  #+end_src
** 1 <name>  (needed)
   <name> is a string ,it is just a name of this anything-source
   #+begin_src c
        my_source["name"]:="my_source_name"
   #+end_src
** 2 <candidate>  (needed)
   <candidate> is an array of available candidates ,or a function name(string)
   without parameter which return an array .
   each element of the array can be :
*** a string
    this string will be displayed on listview , so that you can select one
    of the candidates ,and execute action on your selected candidate.
   for example:
   #+begin_src c
            my_candidates:=Array("red","green")
   #+end_src
      or
      #+begin_src c
            my_candidates_fun()
            {
                return Array("red","green")
            }
            my_candiates:="my_candidates_fun"
           my_source["candidate"]:=my_candidates
      #+end_src
*** an array
    the first element of this array must be a string ,the string will be
    displayed on listview ,and you can selected one of the candidates ,and
    execute action on your selected candidate.
    other element of this array can be anything , you can store useful info.
    there. and when you execute action on your selected candidate,this will
    be the parameter . see <action>
      for example:
      #+begin_src c
            my_candidates:=Array(
                      Array("red","useful info ,string ,object or anything"),
                      Array("green","useful info ,string ,object or anything")
                      )
      #+end_src

