ahk_scripts/anything-doc.html
<li id="sec-4-1-1">if you only have one anything-source : <br/>
       anything<sub>explorer</sub><sub>history</sub><sub>source</sub>  (defined in  anything-explorer-history.ahk)
       you can use it like this :



<pre class="src src-c"><span class="org-preprocessor">#include</span> anything.ahk
<span class="org-preprocessor">#include</span> anything-explorer-history.ahk
f3::anything(anything_explorer_history_source)
</pre>




</li>
</ul>
<ul>
<li id="sec-4-1-2">if you also have other anything-sources , <br/>
        default  : it is included in anything-config.ahk
        you just need add 
            anything<sub>explorer</sub><sub>history</sub><sub>source</sub>
        to the sources
       for example :



<pre class="src src-c">f3::
sources:=Array()
sources.insert(anything_explorer_history_source)
sources.insert(anything_favorite_directories_source)
sources.insert(anything_cmd_source)
anything_multiple_sources(sources)
<span class="org-keyword">return</span>
</pre>



</li>
</ul>
<ul>
<li id="sec-4-1-3">actions for anything-explorer-history.ahk <br/>



<pre class="src src-c">anything_explorer_history_source[<span class="org-string">"action"</span>]:=Array(<span class="org-string">"visit_directory"</span>,<span class="org-string">"delete_from_directory_history"</span> ,<span class="org-string">"delete_all_directory_history"</span>)
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">actions</th><th scope="col" class="left">description</th><th scope="col" class="left">key binding</th></tr>
</thead>
<tbody>
<tr><td class="left">visit<sub>directory</sub></td><td class="left">visit selected directory</td><td class="left">&lt;Click&gt;and  &lt;Enter&gt;</td></tr>
<tr><td class="left">delete<sub>from</sub><sub>directory</sub><sub>history</sub></td><td class="left">delete select directory from  directory history</td><td class="left">&lt;Ctrl-j&gt;</td></tr>
<tr><td class="left">delete<sub>all</sub><sub>directory</sub><sub>history</sub></td><td class="left">add a new directory to  directory history</td><td class="left">&lt;Ctrl-m&gt;</td></tr>
<tr><td class="left">list all actions</td><td class="left"></td><td class="left">&lt;Ctrl-L&gt;</td></tr>
</tbody>
</table>


</li>
</ul>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">anything-favorite-directories.ahk  do something like anything-explorer-history.ahk </h3>
<div class="outline-text-3" id="text-4-2">

<p>   add your favorite directories ,and visit it using "Anything".
   about how to use it .see comments in anything-favorite-directories.ahk
   if you use anything-favorites-directory as the only source for anything.ahk
   you just need to bind it to a key like this :
</p>


<pre class="src src-c"><span class="org-preprocessor">#include</span> anything.ahk
<span class="org-preprocessor">#include</span> anything-favorites-directory.ahk
f1::anything(anything_favorite_directories_source)
</pre>




<p>
   if you also use other sources ,just need add "anything<sub>favorite</sub><sub>directories</sub><sub>source</sub>" to 
   the array of sources for anything<sub>multiple</sub><sub>sources</sub>(sources)
   default have added to  anything-config.ahk 
</p>
<ul>
<li id="sec-4-2-1">how to add a new Folder to your favorite-directories <br/>
   first activate "Anything" and Press &lt;Ctrl-L&gt; list all available actions
   select "call action: Favdirs.anything<sub>favorite</sub><sub>directories</sub><sub>add</sub> "
   about what the meaning of &lt;Ctrl-L&gt;
   anything<sub>favorite</sub><sub>directories</sub><sub>source</sub> have three actions
   anything<sub>favorite</sub><sub>directories</sub><sub>source[</sub>"action"]:=Array("anything<sub>favorite</sub><sub>directories</sub><sub>visit</sub>","anything<sub>favorite</sub><sub>directories</sub><sub>delete</sub>","anything<sub>favorite</sub><sub>directories</sub><sub>add</sub>")
</li>
</ul>
<ul>
<li id="sec-4-2-2">actions for   anything-favorite-directories.ahk <br/>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">actions</th><th scope="col" class="left">description</th><th scope="col" class="left">key binding</th></tr>
</thead>
<tbody>
<tr><td class="left">anything<sub>favorite</sub><sub>directories</sub><sub>visit</sub></td><td class="left">visit selected directory</td><td class="left">&lt;Click&gt;and  &lt;Enter&gt;</td></tr>
<tr><td class="left">anything<sub>favorite</sub><sub>directories</sub><sub>delete</sub></td><td class="left">delete select directory from favorite directories</td><td class="left">&lt;Ctrl-j&gt;</td></tr>
<tr><td class="left">anything<sub>favorite</sub><sub>directories</sub><sub>add</sub></td><td class="left">add a new directory to favorite directories</td><td class="left">&lt;Ctrl-m&gt;</td></tr>
<tr><td class="left">list all actions</td><td class="left"></td><td class="left">&lt;Ctrl-L&gt;</td></tr>
</tbody>
</table>


</li>
</ul>
<ul>
<li id="sec-4-2-3">then you can use "Anything" selected one of your favorite directory <br/>
<ul>
<li>it will visit it in current Explorer.exe (if current activated window is Explorer.exe)
</li>
<li>it will visit it in current cmd.exe (if current activated window is cmd.exe)
</li>
<li>it will visit it in current msys.bat (if current activated window is msys.bat)
</li>
</ul>



</li>
</ul>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">anything-run.ahk is a replacement of &lt;Win-r&gt; </h3>
<div class="outline-text-3" id="text-4-3">

<p>   it could remember old  command too. when you press &lt;F3&gt;
   about how to use it .see comments in anything-run.ahk
</p></div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4">anything-window-switch.ahk is a replacement of Alt-Tab </h3>
<div class="outline-text-3" id="text-4-4">


</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5">you just need download: </h3>
<div class="outline-text-3" id="text-4-5">

<ul>
<li>anything.ahk
</li>
<li>anything-explorer-history.ahk
</li>
<li>anything-favorite-directories.ahk
</li>
<li>anything-run.ahk
</li>
<li>anything-window-switch.ahk
</li>
<li>anything-config.ahk
</li>
<li>and run anything-config.ahk
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">how to  write an anything-source </h2>
<div class="outline-text-2" id="text-5">

<p>  an anything-source is an Object with some defined properties
  now it support 5 anything-source-properties :
</p><ul>
<li>name
</li>
<li>action
</li>
<li>candidate
</li>
<li>icon
</li>
<li>anything-execute-action-at-once-if-one
</li>
</ul>

<p>  for example:
</p>


<pre class="src src-c"><span class="org-constant">my_source</span>:=Object()
</pre>




</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">1 &lt;name&gt;  (needed) </h3>
<div class="outline-text-3" id="text-5-1">

<p>   &lt;name&gt; is a string ,it is just a name of this anything-source
</p>


<pre class="src src-c">my_source[<span class="org-string">"name"</span>]:=<span class="org-string">"my_source_name"</span>
</pre>



</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">2 &lt;candidate&gt;  (needed) </h3>
<div class="outline-text-3" id="text-5-2">

<p>   &lt;candidate&gt; is an array of available candidates ,or a function name(string)
   without parameter which return an array .
   each element of the array can be :
</p><ul>
<li id="sec-5-2-1">a string <br/>
    this string will be displayed on listview , so that you can select one
    of the candidates ,and execute action on your selected candidate.
   for example:



<pre class="src src-c"><span class="org-constant">my_candidates</span>:=Array(<span class="org-string">"red"</span>,<span class="org-string">"green"</span>)
</pre>



<p>
      or
</p>


<pre class="src src-c"> <span class="org-function-name">my_candidates_fun</span>()
 {
     <span class="org-keyword">return</span> Array(<span class="org-string">"red"</span>,<span class="org-string">"green"</span>)
 }
 <span class="org-constant">my_candiates</span>:=<span class="org-string">"my_candidates_fun"</span>
my_source[<span class="org-string">"candidate"</span>]:=my_candidates
</pre>



</li>
</ul>
<ul>
<li id="sec-5-2-2">an array <br/>
    the first element of this array must be a string ,the string will be
    displayed on listview ,and you can selected one of the candidates ,and
    execute action on your selected candidate.
    other element of this array can be anything , you can store useful info.
    there. and when you execute action on your selected candidate,this will
    be the parameter . see &lt;action&gt;
      for example:



<pre class="src src-c"><span class="org-constant">my_candidates</span>:=Array(
          Array(<span class="org-string">"red"</span>,<span class="org-string">"useful info ,string ,object or anything"</span>),
          Array(<span class="org-string">"green"</span>,<span class="org-string">"useful info ,string ,object or anything"</span>)
          )
</pre>




</li>
</ul>
</div>

</div>
