ahk_scripts/anything-doc.org
** 3 <action>  (needed)
   <action> is a function name(string) or a list of function name (array).
   and those functions must have one parameter. actually the parameter is
   the selected <candidate> .
   #+begin_src c
         my_action:="my_action_fun"
                  my_action_fun(candidate)
                {
                  MsgBox , %candidate%
                }
   #+end_src
      or
      #+begin_src c
        my_action:=Array("my_action_fun","my_action_fun2")
                  my_action_fun(candidate)
                {
                  MsgBox , %candidate%
                }
                  my_action_fun2(candidate)
                {
                  MsgBox , %candidate%
                }

      my_source["action"]:=my_action
      #+end_src
** 4 <icon> (optional)
    <icon> is a function(string) which return a ImageList.
    this property is optional .if this property isn't empty
    <Anything> will display icon before each candidates.
    #+begin_src c
     icon_fun()
     {
         ImageListID := IL_Create(10)  ; Create an ImageList to hold 10 small icons.
         Loop 10  ; Load the ImageList with a series of icons from the DLL.
         IL_Add(ImageListID, "shell32.dll", A_Index)
         return ImageListID
     }
    my_icon :="icon_fun"
    my_source["icon"]:=my_icon
    #+end_src

** 5 <anything-execute-action-at-once-if-one> (optional)
    if it has value
  for example
  #+begin_src c
          my_source["anything-execute-action-at-once-if-one"]:="yes"
  #+end_src
then if only one candidate left on the listview it will execute the
    default action with the candidate
** 6 call anything
   #+begin_src c
    anything(my_source)
   #+end_src
