ahk_scripts/anything-doc.html

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3">3 &lt;action&gt;  (needed) </h3>
<div class="outline-text-3" id="text-5-3">

<p>   &lt;action&gt; is a function name(string) or a list of function name (array).
   and those functions must have one parameter. actually the parameter is
   the selected &lt;candidate&gt; .
</p>


<pre class="src src-c"><span class="org-constant">my_action</span>:=<span class="org-string">"my_action_fun"</span>
         my_action_fun(candidate)
       {
         MsgBox , %candidate%
       }
</pre>



<p>
      or
</p>


<pre class="src src-c">  <span class="org-constant">my_action</span>:=Array(<span class="org-string">"my_action_fun"</span>,<span class="org-string">"my_action_fun2"</span>)
            <span class="org-function-name">my_action_fun</span>(candidate)
          {
            MsgBox , %candidate%
          }
            <span class="org-function-name">my_action_fun2</span>(candidate)
          {
            MsgBox , %candidate%
          }

my_source[<span class="org-string">"action"</span>]:=my_action
</pre>



</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4">4 &lt;icon&gt; (optional) </h3>
<div class="outline-text-3" id="text-5-4">

<p>    &lt;icon&gt; is a function(string) which return a ImageList.
    this property is optional .if this property isn't empty
    &lt;Anything&gt; will display icon before each candidates.
</p>


<pre class="src src-c"> <span class="org-function-name">icon_fun</span>()
 {
     <span class="org-constant">ImageListID</span> := IL_Create(10)  ; Create an ImageList <span class="org-type">to</span> <span class="org-variable-name">hold</span> 10 small icons.
     Loop 10  ; Load the ImageList with a series of icons from <span class="org-type">the</span> <span class="org-variable-name">DLL</span>.
     IL_Add(ImageListID, <span class="org-string">"shell32.dll"</span>, A_Index)
     <span class="org-keyword">return</span> ImageListID
 }
<span class="org-constant">my_icon</span> :=<span class="org-string">"icon_fun"</span>
my_source[<span class="org-string">"icon"</span>]:=my_icon
</pre>




</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5">5 &lt;anything-execute-action-at-once-if-one&gt; (optional) </h3>
<div class="outline-text-3" id="text-5-5">

<p>    if it has value
  for example
</p>


<pre class="src src-c">my_source[<span class="org-string">"anything-execute-action-at-once-if-one"</span>]:=<span class="org-string">"yes"</span>
</pre>



<p>
then if only one candidate left on the listview it will execute the
    default action with the candidate
</p></div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6">6 call anything </h3>
<div class="outline-text-3" id="text-5-6">




<pre class="src src-c">anything(my_source)
</pre>



</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-12-19 11:59:14 中国标准时间</p>
<p class="author">Author: 纪秀峰</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>


</div>
<p><br/><br/>
<!-- hhmts start --> <!-- hhmts end --></p>

</body>
</html>
